Azure-Samples/ESP-Samples/samples/azure-esp-pnp-starter/main/src/utilities/esp32azurekit_interface.c
/************************************************************************************************
 * This code was automatically generated by Digital Twin Code Generator tool 0.6.3.
 * Changes to this file may cause incorrect behavior and will be lost if the code is regenerated.
 *
 * Generated Date: Thursday, November 7, 2019
 ***********************************************************************************************/

#include "inc/utilities/esp32azurekit_interface.h"

#define MAX_MASSAGE_SIZE 256

//
// Callback function declarations and DigitalTwin writable (from service side) properties for this interface
//

static void Esp32AzureKitInterface_Property_FanSpeedCallback(const DIGITALTWIN_CLIENT_PROPERTY_UPDATE* dtClientPropertyUpdate, void* userInterfaceContext);

static void Esp32AzureKitInterface_Property_TempThresholdCallback(const DIGITALTWIN_CLIENT_PROPERTY_UPDATE* dtClientPropertyUpdate, void* userInterfaceContext);

//
//  Callback function declarations and DigitalTwin command names for this interface.
//

static void Esp32AzureKitInterface_Command_EchoCallback(const DIGITALTWIN_CLIENT_COMMAND_REQUEST* commandRequest, DIGITALTWIN_CLIENT_COMMAND_RESPONSE* commandResponse, void* userInterfaceContext);

static void Esp32AzureKitInterface_Command_StartFanCallback(const DIGITALTWIN_CLIENT_COMMAND_REQUEST* commandRequest, DIGITALTWIN_CLIENT_COMMAND_RESPONSE* commandResponse, void* userInterfaceContext);

static void Esp32AzureKitInterface_Command_StopFanCallback(const DIGITALTWIN_CLIENT_COMMAND_REQUEST* commandRequest, DIGITALTWIN_CLIENT_COMMAND_RESPONSE* commandResponse, void* userInterfaceContext);

//
// Application state associated with this interface.
// It contains the DIGITALTWIN_INTERFACE_CLIENT_HANDLE used for responses in callbacks along with properties set
// and representations of the property update and command callbacks invoked on given interface
//
typedef struct ESP32AZUREKIT_INTERFACE_STATE_TAG
{
    DIGITALTWIN_INTERFACE_CLIENT_HANDLE interfaceClientHandle;

    double fanSpeed;

    double tempThreshold;

} ESP32AZUREKIT_INTERFACE_STATE;

static ESP32AZUREKIT_INTERFACE_STATE appState;

// Callback function to process the command "echo".
void Esp32AzureKitInterface_Command_EchoCallback(const DIGITALTWIN_CLIENT_COMMAND_REQUEST* commandRequest, DIGITALTWIN_CLIENT_COMMAND_RESPONSE* commandResponse, void* userInterfaceContext)
{
    ESP32AZUREKIT_INTERFACE_STATE* interfaceState = (ESP32AZUREKIT_INTERFACE_STATE*)userInterfaceContext;
    LogInfo("ESP32AZUREKIT_INTERFACE: echo command invoked.");
    LogInfo("ESP32AZUREKIT_INTERFACE: echo request payload=<%.*s>, context=<%p>", (int)commandRequest->requestDataLen, commandRequest->requestData, interfaceState);

    // Get payload string
    char* requestData = (char*)malloc(commandRequest->requestDataLen + 1);
    if (requestData != NULL)
    {
        strncpy(requestData, (char*)commandRequest->requestData, commandRequest->requestDataLen);
        requestData[commandRequest->requestDataLen] = 0;
    }
    else
    {
        LogError("Failed to allocate memory for request payload");
    }

    // Parse request parameters from request payload string
    JSON_Value *jsonValue = NULL;
    jsonValue = json_parse_string((const char*)requestData);

    JSON_Object *jsonPayload = json_value_get_object(jsonValue);
    ESP32AZUREKIT_ECHO_echocommandrequest echocommandrequest;

    mallocAndStrcpy_s(&echocommandrequest.displayedValue, (char*)json_object_get_string(jsonPayload, "displayedValue"));

    // Invoke device command here
    unsigned int statusCode = 200;

    char responsePayload[MAX_MASSAGE_SIZE];

    char* response;

    DIGITALTWIN_COMMAND_RESULT commandResult = Esp32AzureKit_Command_Echo(&echocommandrequest, &response, &statusCode);

    // Serialize command response payload

    if (commandResult == DIGITALTWIN_COMMAND_OK &&
        Esp32AzureKit_SerializeEchoCommandResponse(response, responsePayload, MAX_MASSAGE_SIZE))
    {
        DigitalTwinClientHelper_SetCommandResponse(commandResponse, responsePayload, statusCode);

    }
    else
    {
        LogError("Failed to execute echo command");
        char* errorResponse = "\"Failed to execute echo command\"";
        DigitalTwinClientHelper_SetCommandResponse(commandResponse, errorResponse, statusCode);
    }

    free(requestData);

    if (jsonValue)
    {
        json_value_free(jsonValue);
    }

    if (echocommandrequest.displayedValue != NULL)
    {
        free(echocommandrequest.displayedValue);
    }

}

// Callback function to process the command "startFan".
void Esp32AzureKitInterface_Command_StartFanCallback(const DIGITALTWIN_CLIENT_COMMAND_REQUEST* commandRequest, DIGITALTWIN_CLIENT_COMMAND_RESPONSE* commandResponse, void* userInterfaceContext)
{
    ESP32AZUREKIT_INTERFACE_STATE* interfaceState = (ESP32AZUREKIT_INTERFACE_STATE*)userInterfaceContext;
    LogInfo("ESP32AZUREKIT_INTERFACE: startFan command invoked.");
    LogInfo("ESP32AZUREKIT_INTERFACE: startFan request payload=<%.*s>, context=<%p>", (int)commandRequest->requestDataLen, commandRequest->requestData, interfaceState);

    // Invoke device command here
    unsigned int statusCode = 200;

    DIGITALTWIN_COMMAND_RESULT commandResult = Esp32AzureKit_Command_StartFan(&statusCode);

    if (commandResult == DIGITALTWIN_COMMAND_OK)
    {
        DigitalTwinClientHelper_SetCommandResponse(commandResponse, NULL, statusCode);

    }
    else
    {
        LogError("Failed to execute startFan command");
        char* errorResponse = "\"Failed to execute startFan command\"";
        DigitalTwinClientHelper_SetCommandResponse(commandResponse, errorResponse, statusCode);
    }

}

// Callback function to process the command "stopFan".
void Esp32AzureKitInterface_Command_StopFanCallback(const DIGITALTWIN_CLIENT_COMMAND_REQUEST* commandRequest, DIGITALTWIN_CLIENT_COMMAND_RESPONSE* commandResponse, void* userInterfaceContext)
{
    ESP32AZUREKIT_INTERFACE_STATE* interfaceState = (ESP32AZUREKIT_INTERFACE_STATE*)userInterfaceContext;
    LogInfo("ESP32AZUREKIT_INTERFACE: stopFan command invoked.");
    LogInfo("ESP32AZUREKIT_INTERFACE: stopFan request payload=<%.*s>, context=<%p>", (int)commandRequest->requestDataLen, commandRequest->requestData, interfaceState);

    // Invoke device command here
    unsigned int statusCode = 200;

    DIGITALTWIN_COMMAND_RESULT commandResult = Esp32AzureKit_Command_StopFan(&statusCode);

    if (commandResult == DIGITALTWIN_COMMAND_OK)
    {
        DigitalTwinClientHelper_SetCommandResponse(commandResponse, NULL, statusCode);

