Azure-Samples/ESP-Samples/samples/azure-esp-pnp-starter/main/src/utilities/esp32azurekit_interface.c
    }
    else
    {
        LogError("Failed to execute stopFan command");
        char* errorResponse = "\"Failed to execute stopFan command\"";
        DigitalTwinClientHelper_SetCommandResponse(commandResponse, errorResponse, statusCode);
    }

}

// DigitalTwinSample_ProcessCommandUpdate receives commands from the server.  This implementation acts as a simple dispatcher
// to the functions to perform the actual processing.
void Esp32AzureKitInterface_ProcessCommandUpdate(const DIGITALTWIN_CLIENT_COMMAND_REQUEST* dtCommandRequest, DIGITALTWIN_CLIENT_COMMAND_RESPONSE* dtCommandResponse, void* userInterfaceContext)
{
    if (strcmp(dtCommandRequest->commandName, Esp32AzureKitInterface_EchoCommand) == 0)
    {
        Esp32AzureKitInterface_Command_EchoCallback(dtCommandRequest, dtCommandResponse, userInterfaceContext);
        return;
    }

    if (strcmp(dtCommandRequest->commandName, Esp32AzureKitInterface_StartFanCommand) == 0)
    {
        Esp32AzureKitInterface_Command_StartFanCallback(dtCommandRequest, dtCommandResponse, userInterfaceContext);
        return;
    }

    if (strcmp(dtCommandRequest->commandName, Esp32AzureKitInterface_StopFanCommand) == 0)
    {
        Esp32AzureKitInterface_Command_StopFanCallback(dtCommandRequest, dtCommandResponse, userInterfaceContext);
        return;
    }

    // If the command is not implemented by this interface, by convention we return a 501 error to server.
    LogError("ESP32AZUREKIT_INTERFACE: Command name <%s> is not associated with this interface", dtCommandRequest->commandName);
    (void)DigitalTwinClientHelper_SetCommandResponse(dtCommandResponse, "\"Requested command not implemented on this interface\"", 501);
}

// Esp32AzureKitInterface_PropertyCallback is invoked when a property is updated (or failed) going to server.
// ALL property callbacks will be routed to this function and just have the userContextCallback set to the propertyName.
// Product code will potentially have context stored in this userContextCallback.
static void Esp32AzureKitInterface_PropertyCallback(DIGITALTWIN_CLIENT_RESULT digitalTwinReportedStatus, void* userContextCallback)
{
    if (digitalTwinReportedStatus == DIGITALTWIN_CLIENT_OK)
    {
        ReportProperty_Succeeded_Callback("Esp32AzureKit", (const char*)userContextCallback);
        LogInfo("ESP32AZUREKIT_INTERFACE: Updating property=<%s> succeeded", (const char*)userContextCallback);
    }
    else
    {
        ReportProperty_Error_Callback("Esp32AzureKit", (const char*)userContextCallback);
        LogError("ESP32AZUREKIT_INTERFACE: Updating property=<%s> failed, error=<%s>", (const char*)userContextCallback, MU_ENUM_TO_STRING(DIGITALTWIN_CLIENT_RESULT, digitalTwinReportedStatus));
    }
}

// Processes a property update, which the server initiated, for 'fanSpeed' property.
static void Esp32AzureKitInterface_Property_FanSpeedCallback(const DIGITALTWIN_CLIENT_PROPERTY_UPDATE* dtClientPropertyUpdate, void* userInterfaceContext)
{
    ESP32AZUREKIT_INTERFACE_STATE* interfaceState = (ESP32AZUREKIT_INTERFACE_STATE*)userInterfaceContext;

    LogInfo("ESP32AZUREKIT_INTERFACE: fanSpeed property invoked...");
    LogInfo("ESP32AZUREKIT_INTERFACE: fanSpeed data=<%.*s>", (int)dtClientPropertyUpdate->propertyDesiredLen, dtClientPropertyUpdate->propertyDesired);

    DIGITALTWIN_CLIENT_PROPERTY_RESPONSE propertyResponse;

    // Version of this structure for C SDK.
    propertyResponse.version = DIGITALTWIN_CLIENT_PROPERTY_RESPONSE_VERSION_1;
    propertyResponse.responseVersion = dtClientPropertyUpdate->desiredVersion;

    // Parse string value and set updated property
    JSON_Value * jsonValue = json_parse_string((const char*)dtClientPropertyUpdate->propertyDesired);

    double newValue = json_value_get_number(jsonValue);

    bool isTypeValid = (json_value_get_type(jsonValue) == JSONNumber);

    if (isTypeValid)
    {
        interfaceState->fanSpeed = (double)newValue;

        LogInfo("ESP32AZUREKIT_INTERFACE: Updating fanSpeed property with new value <%s> ...", dtClientPropertyUpdate->propertyDesired);
        bool updateResult = Esp32AzureKit_Property_FanSpeedCallback(interfaceState->fanSpeed);
 
        if (updateResult)
        {
            propertyResponse.statusCode = 200;
            propertyResponse.statusDescription = "fanSpeed property is updated successfully";
        }
        else
        {
            LogError("ESP32AZUREKIT_INTERFACE: failed to update writable property fanSpeed...");

            propertyResponse.statusCode = 500;
            propertyResponse.statusDescription = "failed to update writable property";
        }
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: Invalid desired value for fanSpeed, value should be Double");
        propertyResponse.statusCode = 500;
        propertyResponse.statusDescription = "Invalid desired value for fanSpeed, value should be Double";
    }
    json_value_free(jsonValue);

    // DigitalTwin_InterfaceClient_ReportPropertyAsync takes the DIGITALTWIN_CLIENT_PROPERTY_RESPONSE and returns information back to service.
    DIGITALTWIN_CLIENT_RESULT result = DigitalTwin_InterfaceClient_ReportPropertyAsync(appState.interfaceClientHandle, Esp32AzureKitInterface_FanSpeedProperty, 
        (const char*)dtClientPropertyUpdate->propertyDesired, &propertyResponse,
        Esp32AzureKitInterface_PropertyCallback, Esp32AzureKitInterface_FanSpeedProperty);
    if (result != DIGITALTWIN_CLIENT_OK)
    {
        LogError("ESP32AZUREKIT_INTERFACE: DigitalTwin_InterfaceClient_ReportPropertyAsync for fanSpeed failed, error=<%s>", MU_ENUM_TO_STRING(DIGITALTWIN_CLIENT_RESULT, result));
    }
    else
    {
        LogInfo("ESP32AZUREKIT_INTERFACE: Successfully queued property update for fanSpeed");
    }
}

// Processes a property update, which the server initiated, for 'tempThreshold' property.
static void Esp32AzureKitInterface_Property_TempThresholdCallback(const DIGITALTWIN_CLIENT_PROPERTY_UPDATE* dtClientPropertyUpdate, void* userInterfaceContext)
{
    ESP32AZUREKIT_INTERFACE_STATE* interfaceState = (ESP32AZUREKIT_INTERFACE_STATE*)userInterfaceContext;

    LogInfo("ESP32AZUREKIT_INTERFACE: tempThreshold property invoked...");
    LogInfo("ESP32AZUREKIT_INTERFACE: tempThreshold data=<%.*s>", (int)dtClientPropertyUpdate->propertyDesiredLen, dtClientPropertyUpdate->propertyDesired);

