Azure-Samples/ESP-Samples/samples/azure-esp-pnp-starter/main/src/utilities/esp32azurekit_interface.c
    DIGITALTWIN_CLIENT_PROPERTY_RESPONSE propertyResponse;

    // Version of this structure for C SDK.
    propertyResponse.version = DIGITALTWIN_CLIENT_PROPERTY_RESPONSE_VERSION_1;
    propertyResponse.responseVersion = dtClientPropertyUpdate->desiredVersion;

    // Parse string value and set updated property
    JSON_Value * jsonValue = json_parse_string((const char*)dtClientPropertyUpdate->propertyDesired);

    double newValue = json_value_get_number(jsonValue);

    bool isTypeValid = (json_value_get_type(jsonValue) == JSONNumber);

    if (isTypeValid)
    {
        interfaceState->tempThreshold = (double)newValue;

        LogInfo("ESP32AZUREKIT_INTERFACE: Updating tempThreshold property with new value <%s> ...", dtClientPropertyUpdate->propertyDesired);
        bool updateResult = Esp32AzureKit_Property_TempThresholdCallback(interfaceState->tempThreshold);
 
        if (updateResult)
        {
            propertyResponse.statusCode = 200;
            propertyResponse.statusDescription = "tempThreshold property is updated successfully";
        }
        else
        {
            LogError("ESP32AZUREKIT_INTERFACE: failed to update writable property tempThreshold...");

            propertyResponse.statusCode = 500;
            propertyResponse.statusDescription = "failed to update writable property";
        }
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: Invalid desired value for tempThreshold, value should be Double");
        propertyResponse.statusCode = 500;
        propertyResponse.statusDescription = "Invalid desired value for tempThreshold, value should be Double";
    }
    json_value_free(jsonValue);

    // DigitalTwin_InterfaceClient_ReportPropertyAsync takes the DIGITALTWIN_CLIENT_PROPERTY_RESPONSE and returns information back to service.
    DIGITALTWIN_CLIENT_RESULT result = DigitalTwin_InterfaceClient_ReportPropertyAsync(appState.interfaceClientHandle, Esp32AzureKitInterface_TempThresholdProperty, 
        (const char*)dtClientPropertyUpdate->propertyDesired, &propertyResponse,
        Esp32AzureKitInterface_PropertyCallback, Esp32AzureKitInterface_TempThresholdProperty);
    if (result != DIGITALTWIN_CLIENT_OK)
    {
        LogError("ESP32AZUREKIT_INTERFACE: DigitalTwin_InterfaceClient_ReportPropertyAsync for tempThreshold failed, error=<%s>", MU_ENUM_TO_STRING(DIGITALTWIN_CLIENT_RESULT, result));
    }
    else
    {
        LogInfo("ESP32AZUREKIT_INTERFACE: Successfully queued property update for tempThreshold");
    }
}

// Esp32AzureKitInterface_ProcessPropertyUpdate receives updated properties from the server.  This implementation
// acts as a simple dispatcher to the functions to perform the actual processing.
static void Esp32AzureKitInterface_ProcessPropertyUpdate(const DIGITALTWIN_CLIENT_PROPERTY_UPDATE* dtClientPropertyUpdate, void* userInterfaceContext)
{
    if (strcmp(dtClientPropertyUpdate->propertyName, Esp32AzureKitInterface_FanSpeedProperty) == 0)
    {
        Esp32AzureKitInterface_Property_FanSpeedCallback(dtClientPropertyUpdate, userInterfaceContext);
        return;
    }

    if (strcmp(dtClientPropertyUpdate->propertyName, Esp32AzureKitInterface_TempThresholdProperty) == 0)
    {
        Esp32AzureKitInterface_Property_TempThresholdCallback(dtClientPropertyUpdate, userInterfaceContext);
        return;
    }

    // If the property is not implemented by this interface, presently we only record a log message but do not have a mechanism to report back to the service
    LogError("ESP32AZUREKIT_INTERFACE: Property name <%s> is not associated with this interface", dtClientPropertyUpdate->propertyName);
}

// Esp32AzureKitInterface_TelemetryCallback is invoked when a DigitalTwin telemetry message is either successfully delivered to the service or else fails.
static void Esp32AzureKitInterface_TelemetryCallback(DIGITALTWIN_CLIENT_RESULT digitalTwinTelemetryStatus, void* userContextCallback)
{
    if (digitalTwinTelemetryStatus == DIGITALTWIN_CLIENT_OK)
    {
        SendTelemetry_Succeeded_Callback("Esp32AzureKit", (const char*)userContextCallback);
        LogInfo("ESP32AZUREKIT_INTERFACE: DigitalTwin successfully delivered telemetry message for <%s>", (const char*)userContextCallback);
    }
    else
    {
        SendTelemetry_Error_Callback("Esp32AzureKit", (const char*)userContextCallback);
        LogError("ESP32AZUREKIT_INTERFACE: DigitalTwin failed to deliver telemetry message for <%s>, error=<%s> ", (const char*)userContextCallback, MU_ENUM_TO_STRING(DIGITALTWIN_CLIENT_RESULT, digitalTwinTelemetryStatus));
    }
}

// SendTelemetry is a helper function which is periodically invoked by the caller to send telemetry
DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_SendTelemetry_Internal(DIGITALTWIN_INTERFACE_CLIENT_HANDLE interfaceHandle, const char* telemetryName, const char* telemetryData)
{
    DIGITALTWIN_CLIENT_RESULT result;

    result = DigitalTwin_InterfaceClient_SendTelemetryAsync(interfaceHandle, telemetryName, telemetryData,
        Esp32AzureKitInterface_TelemetryCallback, (void*)telemetryName);

    if (result != DIGITALTWIN_CLIENT_OK)
    {
        LogError("ESP32AZUREKIT_INTERFACE:: DigitalTwin_InterfaceClient_SendTelemetryAsync failed for sending %s", telemetryName);
    }
    else
    {
        LogInfo("ESP32AZUREKIT_INTERFACE:: DigitalTwin_InterfaceClient_SendTelemetryAsync successfully sent %s", telemetryName);
    }

    DigitalTwinClientHelper_Check();
    return result;
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendAll()
{
    DIGITALTWIN_CLIENT_RESULT result;

    // NOTE: Future versions of SDK will support ability to send multiple telemetries in a single
    // send.  For now, one at a time is sufficient albeit less efficient.
    if (((result = Esp32AzureKitInterface_Telemetry_SendPitch()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendRoll()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendPressure()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendAltitude()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendMagnetX()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendMagnetY()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendMagnetZ()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendTemp()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendHumid()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendLight()) != DIGITALTWIN_CLIENT_OK) ||
        ((result = Esp32AzureKitInterface_Telemetry_SendMinFreeHeap()) != DIGITALTWIN_CLIENT_OK) )

    {
        LogError("ESP32AZUREKIT_INTERFACE: failed to send telemetries");
    }
    else
    {
        LogInfo("ESP32AZUREKIT_INTERFACE: Queuing of all telemetries to be sent has succeeded");
    }

    return result;
}

