Azure-Samples/ESP-Samples/samples/azure-esp-pnp-starter/main/src/utilities/esp32azurekit_interface.c
DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendPitch()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializePitchTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_PitchTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message pitch failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendRoll()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializeRollTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_RollTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message roll failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendPressure()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializePressureTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_PressureTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message pressure failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendAltitude()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializeAltitudeTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_AltitudeTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message altitude failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendMagnetX()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializeMagnetXTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_MagnetXTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message MagnetX failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendMagnetY()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializeMagnetYTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_MagnetYTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message MagnetY failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendMagnetZ()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializeMagnetZTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_MagnetZTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message MagnetZ failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendTemp()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializeTempTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_TempTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message temp failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendHumid()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializeHumidTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_HumidTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message humid failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

DIGITALTWIN_CLIENT_RESULT Esp32AzureKitInterface_Telemetry_SendLight()
{
    if (appState.interfaceClientHandle == NULL)
    {
        LogError("ESP32AZUREKIT_INTERFACE: interfaceClientHandle is required to be initialized before sending telemetries");
    }

    char payloadBuffer[MAX_MASSAGE_SIZE];
    if (Esp32AzureKit_SerializeLightTelemetry(payloadBuffer, MAX_MASSAGE_SIZE))
    {
        return Esp32AzureKitInterface_SendTelemetry_Internal(appState.interfaceClientHandle, Esp32AzureKitInterface_LightTelemetry, payloadBuffer);
    }
    else
    {
        LogError("ESP32AZUREKIT_INTERFACE: serialize telemetry message light failed.");
        return DIGITALTWIN_CLIENT_ERROR;
    }
}

